# This is a file written in Emacs and authored using org-mode (http://orgmode.org/)
# The corresponding Markdown file is generated by running the
# "M-x org-md-export-to-markdown" command from inside of Emacs.
# 
# The rest of the files are generated from this file by running the
# "M-x org-babel-tangle" command from inside of Emacs.
# 
# The options below control the behavior of org-md-export-to-markdown:
#
# Don't render a Table of Contents 
#+OPTIONS: toc:nil
# Don't render section numbers
#+OPTIONS: num:nil
# Turn of subscript parsing: http://super-user.org/wordpress/2012/02/02/how-to-get-rid-of-subscript-annoyance-in-org-mode/comment-page-1/
#+OPTIONS: ^:{}
* Dependencies
  This script depends on the command line tools listed below. These
  requirements should be automatically included via the =nix-shell=
  directives in the script, but are listed below for the sake of
  completeness.

  #+BEGIN_SRC python :var table=requirements-table :results html :noweb yes :cache yes :exports results
    data = <<table-to-dict(requirements-table)>>
    output = "| Name | Version | Description | License |\n"
    output += "| ---- | --- | --- | --- |\n"
    for package in data:
	if not package['name']:
	    continue
	output += "| [{name}]({url}) | {version} | {description} | [{license}]({license_url}) |\n".format(**package)
    return output
  #+END_SRC

  #+RESULTS[2f1bc451b8a6bfd5e67a98ad8965a7823fac6016]:
  #+BEGIN_HTML
  | Name | Version | Description | License |
  | ---- | --- | --- | --- |
  | [requests](https://cryptography.io/) | 2.11.1 | HTTP Requests for Humans | [Apache 2.0 or BSD](https://github.com/pyca/cryptography/blob/master/LICENSE) |
  | [cryptography](http://docs.python-requests.org/en/latest/) | 1.5.2 | Exposes cryptographic recipes and primitives | [Apache 2.0](https://github.com/kennethreitz/requests/blob/master/LICENSE) |
  #+END_HTML

